<a href="https://colab.research.google.com/github/harika300805/ML-workshop/blob/main/Assignment_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#1. Create a Pandas DataFrame from the following dictionary:
import pandas as pd
data = {
 'Name': ['Alice', 'Bob', 'Carol'],
 'Age': [24, 27, 22],
 'Salary': [50000, 55000, 48000]
}
df = pd.DataFrame(data)
print(df)
#Add a new column called Bonus which is 10% of the salary.
col={ 'Bonus' : 0.1*df['Salary']}
df=pd.concat([df,pd.DataFrame(col)],axis=1)
print(df)

    Name  Age  Salary
0  Alice   24   50000
1    Bob   27   55000
2  Carol   22   48000
    Name  Age  Salary   Bonus
0  Alice   24   50000  5000.0
1    Bob   27   55000  5500.0
2  Carol   22   48000  4800.0

In [ ]:
#2. Display the first two rows.
print("The first two rows are: \n",df.head(2))
#Compute the mean salary
print("Mean of the salary is: ",df['Salary'].mean())

The first two rows are:
     Name  Age  Salary   Bonus
0  Alice   24   50000  5000.0
1    Bob   27   55000  5500.0
Mean of the salary is:  51000.0

In [ ]:
#3. Extract all rows where the Age is greater than 25
print("The rows where age is greater than 25 are: \n",df[df['Age']>25])
#Filter out rows where the Salary is less than 50000.
print("The rows where salary is less than 50000 are: \n",df[df['Salary']<50000])

The rows where age is greater than 25 are:
   Name  Age  Salary   Bonus
1  Bob   27   55000  5500.0
The rows where salary is less than 50000 are:
     Name  Age  Salary   Bonus
2  Carol   22   48000  4800.0

In [ ]:
#4. Create the DataFrame
import pandas as pd
data = {
 'A': [1, 2, None, 4],
 'B': [None, 2, 3, None],
 'C': [1, 2, 3, 4]
}
df = pd.DataFrame(data)
print(df)
# Fill missing values in column A with the mean of the column
df['A'] = df['A'].fillna(df['A'].mean())
print(df)
#Drop rows where all values are None
df = df.dropna(how='all')
print(df)

     A    B  C
0  1.0  NaN  1
1  2.0  2.0  2
2  NaN  3.0  3
3  4.0  NaN  4
          A    B  C
0  1.000000  NaN  1
1  2.000000  2.0  2
2  2.333333  3.0  3
3  4.000000  NaN  4
          A    B  C
0  1.000000  NaN  1
1  2.000000  2.0  2
2  2.333333  3.0  3
3  4.000000  NaN  4

In [ ]:
#5. Create a DataFrame for employees
import pandas as pd
data = { 'Department': ['HR', 'HR', 'IT', 'IT', 'Finance'], 'Employee': ['Alice', 'Bob', 'Carol', 'David', 'Eve'], 'Salary': [50000, 45000, 60000, 65000, 70000] }
df=pd.DataFrame(data)
print(df)
#Group the data by Department and compute the total and mean salary for each department.
print(df.groupby('Department').agg({'Salary': ['sum', 'mean']}))

  Department Employee  Salary
0         HR    Alice   50000
1         HR      Bob   45000
2         IT    Carol   60000
3         IT    David   65000
4    Finance      Eve   70000
            Salary
               sum     mean
Department
Finance      70000  70000.0
HR           95000  47500.0
IT          125000  62500.0

In [ ]:
#6.Given two DataFrames:
#Perform an inner join on the ID column.
import pandas as pd
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Carol']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Age': [25, 30, 22]})
print(f"DF1 \n{df1}\n")
print(f"DF2 \n{df2}\n")
print(f" After inner join: \n {df1.merge(df2,on='ID',how='inner')}")

DF1
   ID   Name
0   1  Alice
1   2    Bob
2   3  Carol

DF2
   ID  Age
0   2   25
1   3   30
2   4   22

 After inner join:
    ID   Name  Age
0   2    Bob   25
1   3  Carol   30

In [ ]:
# 7. Given a small dataset, clean and display basic statistics using Pandas
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', None],
    'Age': [25, None, 30, 29, 22],
    'Salary': [50000, 60000, None, 70000, 40000]
}
df = pd.DataFrame(data)
print("Original Dataset:")
print(df)
cleaned_df = df.dropna()
print("\nCleaned Dataset: ")
print(cleaned_df)
print("\nBasic Statistics:")
print(cleaned_df.describe(include='all'))

Original Dataset:
      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  30.0      NaN
3    David  29.0  70000.0
4     None  22.0  40000.0

Cleaned Dataset:
    Name   Age   Salary
0  Alice  25.0  50000.0
3  David  29.0  70000.0

Basic Statistics:
         Name        Age        Salary
count       2   2.000000      2.000000
unique      2        NaN           NaN
top     Alice        NaN           NaN
freq        1        NaN           NaN
mean      NaN  27.000000  60000.000000
std       NaN   2.828427  14142.135624
min       NaN  25.000000  50000.000000
25%       NaN  26.000000  55000.000000
50%       NaN  27.000000  60000.000000
75%       NaN  28.000000  65000.000000
max       NaN  29.000000  70000.000000

In [ ]:
# 9. Data Transformation
# Load a dataset containing daily temperatures and dates. Perform the following:
# Convert the date column into a DateTime object.
# Create a new column that categorizes temperatures into High, Medium, or Low.
import pandas as pd
data = {
    'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05'],
    'Temperature': [15, 22, 30, 8, 25]
}

df = pd.DataFrame(data)
print(df)
df['Date'] = pd.to_datetime(df['Date'])

df['Category'] = pd.cut(
    df['Temperature'],
    bins=[-float('inf'), 15, 25, float('inf')],
    labels=['Low', 'Medium', 'High']
)

print("\n Altered Dataset:")
print(df)

         Date  Temperature
0  2024-01-01           15
1  2024-01-02           22
2  2024-01-03           30
3  2024-01-04            8
4  2024-01-05           25

 Altered Dataset:
        Date  Temperature Category
0 2024-01-01           15      Low
1 2024-01-02           22   Medium
2 2024-01-03           30     High
3 2024-01-04            8      Low
4 2024-01-05           25   Medium